Reports/СТО_Сводный_СферыИСвязанныеКатегорииПоДатеЗакрытияЗадачи_v122020.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Report>
		<Properties>
			<Name>СТО_Сводный_СферыИСвязанныеКатегорииПоДатеЗакрытияЗадачи_v122020</Name>
			<Comment>Анализируются только завершенные бизнес-процессы</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Варианты</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекВариант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/Звонки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Звонки</Name>
			<Comment>Реестр входящих и исходящих звонков</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время выполнения звонка</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Comment>Регион внешнего абонента</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Comment>Сервер телефонии</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Принят</Name>
					<Comment>Индикатор состоявшегося звонка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Comment>Инициатор звонка</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
						<v8:Type>cfg:CatalogRef.ТелВнешние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗаписи</Name>
					<Comment>Имя файла с записью звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВходящий</Name>
					<Comment>Направление звонка</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнутренний</Name>
					<Comment>Телефон внутреннего абонента завершившего звонок</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелВнутренние</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходаОчередь</Name>
					<Comment>Под каким порядковым номером звонок помещен в очередь</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВыходаОчередь</Name>
					<Comment>Под каким порядковым номером звонок был в очереди, когода абонент прервал вызов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Comment>Сигнатура звонка</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Продажи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество автомобилей при продаже автомобилей, при ремонтах - количество часов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Точка</Name>
					<Comment>С 05.06.2020 для заказ-нарядов ОУ точка заказ-наряда подменяется точкой машинозаезда, т.к. это могут быть разные точки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата и время события (совпадает с датой документа - регистратора)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопДата</Name>
					<Comment>Дополнительная дата: для заказ-наряда это дата окончания (закрытия)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Comment>Виды событий: "продажа", "ремонт"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Comment>Возможен список значений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаОбъекта</Name>
					<Comment>Комлектация/ВидРемонта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Наименование покупателя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентВнешний</Name>
					<Comment>Телефон внешнего абонента (контрагента)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник, сопровождающий продажу (менеджер, мастер-приемщик и т.д.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникГУИД</Name>
					<Comment>ГУИД сотрудника из базы-источника. Для ОУ - это не сотрудник из реализации, а сотрудник из сделки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДругиеСотрудники</Name>
					<Comment>Сотрудник, сопровождающий продажу (менеджер, мастер-приемщик и т.д.)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Comment>ГУИД покупателя из базы-источника</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Для заказ-нарядов новой ОУСТО - дата приемки авто (ЗаказНаряд.ДатаНачалаФакт)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пакет</Name>
					<Comment>Пакет продаж, в который входит данный документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Для новой ОУ СТО - дата окончания факт (ДатаОкончанияФакт)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>Наименование контактного лица</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Магистральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Машинозаезд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаЗаказНаряда</Name>
					<Comment>Истинная точка заказ-наряда, не подменяемая на точку машинозаезда</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сигнатура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>39</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТочкиПродажВподразделения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ТочкиПродажВподразделения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предприятие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДопРеквизитАдресации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Точка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/СТО_Сводный_СферыИСвязанныеКатегорииПоДатеЗакрытияЗадачи_v122020/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Элементы.Вариант.СписокВыбора.Добавить("СводныйОбщий",		"Сводный общий");
	//Элементы.Вариант.СписокВыбора.Добавить("СводныйГАЗ",		"Сводный ГАЗ");
	//Элементы.Вариант.СписокВыбора.Добавить("СводныйУАЗ",		"Сводный УАЗ");
	//Элементы.Вариант.СписокВыбора.Добавить("СводныйFord",		"Сводный Ford");
	//Элементы.Вариант.СписокВыбора.Добавить("Детальный общий", 	"Детальный");
	//
	////Если открываемый отчет - расшифровка основного отчета, установи вариант как в основном отчете
	////---------------------------------------------------------------------------------------------
	//Вар = "";
	//Доступно = Истина;
	//Доступно = Доступно И Параметры.Свойство("ТекВариант", Вар) = Истина;
	//Доступно = Доступно И ЗначениеЗаполнено(Параметры.ТекВариант);
	//Если Доступно Тогда
	//	Отчет.ТекВариант = Параметры.ТекВариант;
	//Иначе
	//	//Вариант по умолчанию, при вызове отчета из меню
	//	//-----------------------------------------------
	//	Отчет.ТекВариант = "СводныйОбщий";
	//КонецЕсли;
	//
	//ВариантОбработкаВыбораНаСервере(Отчет.ТекВариант);
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьНастроек(Команда)
	Элементы.ГруппаСтраницы.Видимость = НЕ Элементы.ГруппаСтраницы.Видимость;
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.Период.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Отчет.Период.ДатаОкончания = КонецМесяца(Отчет.Период.ДатаНачала);
	
	Элементы.ГруппаСтраницы.Видимость = Ложь;
	
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	Диалог = Новый ДиалогРедактированияСтандартногоПериода(); 
	Диалог.Период = Отчет.Период;
	
	Оп = Новый ОписаниеОповещения("НаЗакрытиеДиалогаПериода", ЭтаФорма);
	Диалог.Показать(Оп);
КонецПроцедуры

&НаКлиенте
Процедура НаЗакрытиеДиалогаПериода(Парам1, Парам2) Экспорт
	Если Парам1 = Неопределено Тогда
		Возврат
	КонецЕсли;
	Отчет.Период = Парам1;
	ОбновитьОтображение();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображение()
	Элементы.ВыборПериода.Заголовок = " "+Формат(Отчет.Период.ДатаНачала, "ДЛФ=Д")+" - "+Формат(Отчет.Период.ДатаОкончания, "ДЛФ=Д");
	Элементы.ВидимостьНастроек.Пометка = Элементы.ГруппаСтраницы.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	рез = РезультатОбработкаРасшифровкиНаСервере(Расшифровка);
	
	Если Не ЗначениеЗаполнено(Рез) Тогда
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(Рез)<>Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(Рез, "#", , 2) =0 Тогда
		Возврат
	КонецЕсли;
	
	Парам = Новый Структура();
	Парам.Вставить("Сигнатура", рез);
	Если Лев(Рез,1) = "0" Тогда
		ИмяОткрываемойФормы = "РегистрСведений.Звонки.Форма.ФормаИсходящегоЧтение";
	Иначе
		ИмяОткрываемойФормы = "РегистрСведений.Звонки.Форма.ФормаВходящегоЧтение";
	КонецЕсли;
	ОткрытьФорму(ИмяОткрываемойФормы, Парам, ЭтаФорма);

КонецПроцедуры

&НаСервере
Функция РезультатОбработкаРасшифровкиНаСервере(Расшифровка)
	РасшифровкаОтчета = ПолучитьИзВременногоХранилища(ЭтаФорма.ДанныеРасшифровки);
	ЭлементыРасшифровки = РасшифровкаОтчета.Элементы;
	РасшифровкаЯчейки =  ЭлементыРасшифровки.Получить(Расшифровка);
	ЗначенияПолейРасш = РасшифровкаЯчейки.ПолучитьПоля();
	ЗначениеПоляРасш = ЗначенияПолейРасш.Получить(0);
	Возврат ЗначениеПоляРасш.Значение;
КонецФункции

//#Область Выбор_Варианта
//&НаСервере
//Процедура ВариантОбработкаВыбораНаСервере(ИмяВарианта)
//	Результат.Очистить();
//	
//	Об = 	РеквизитФормыВЗначение("Отчет");
//	СхемаКомпоновкиДанных = РеквизитФормыВЗначение("Отчет").ПолучитьСКД(ИмяВарианта, "C:\Users\Public\Documents\"+ИмяВарианта+".xml");
//	АдресВремХран	=  ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);

//	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВремХран);
//	Отчет.КомпоновщикНастроек.Инициализировать(ИсточникДоступныхНастроек);
//	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
//КонецПроцедуры

//&НаКлиенте
//Процедура ТекВариантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//	ВариантОбработкаВыбораНаСервере(ВыбранноеЗначение)
//КонецПроцедуры
//#КонецОбласти

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПрефиксов(Команда)
	Парам = Новый Структура();
	Парам.Вставить("РегистрСведений",	"УчетнаяПолитика");
	Парам.Вставить("Измерение",			"Параметр");
	Парам.Вставить("Ресурс",			"Значение");
	Парам.Вставить("ЗначениеИзмерения",	"Лояльность_ПрефиксыКатегорий");
	ОткрытьФорму("Обработка.НастроечныеТаблицыXMLвУчетнойПолитике.Форма.Форма", Парам, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	УстановиОтборы();
КонецПроцедуры

&НаСервере
Процедура УстановиОтборы()
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПользователиПодразделения.Подразделение.Код КАК Код,
	|	ПользователиПодразделения.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ВТ01
	|ИЗ
	|	Справочник.Пользователи.Подразделения КАК ПользователиПодразделения
	|ГДЕ
	|	ПользователиПодразделения.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Предприятие.Код КАК Код
	|ИЗ
	|	Справочник.Предприятие КАК Предприятие
	|ГДЕ
	|	Предприятие.Ссылка В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				ВТ01.Подразделение
	|			ИЗ
	|				ВТ01)";
	Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийПользователь);
	РезультатЗапроса = ОбщегоНазначения.ВыполнитьЗапрос(Запрос);
	ДоступныеПодразделенияКоды = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0);
	
	МассивДоступныхТочекПродаж = Новый Массив();
	
	Если ДоступныеПодразделенияКоды.Количество()>0 Тогда
		Обр = Обработки.НастроечныеТаблицыXMLвУчетнойПолитике.Создать();
		Обр.УстановитьНастройки();
		Обр.Прочитать();
		
		Для Каждого Эл Из ДоступныеПодразделенияКоды Цикл
			Отб = Новый Структура();
			Отб.Вставить("Колонка2", Эл);
			Найденные = Обр.ТЗ.НайтиСтроки(Отб);
			Для Каждого Найденная Из Найденные Цикл
				МассивДоступныхТочекПродаж.Добавить(Найденная.Колонка1);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	//Получи перечень точек оформления, фигуировавших в течении последнего месяца
	//---------------------------------------------------------------------------
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Точка ИЗ РегистрСведений.Продажи ГДЕ Вид = &Вид И Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаДок, МЕСЯЦ, -3) И &ДатаДок УПОРЯДОЧИТЬ ПО Точка");
	Запрос.УстановитьПараметр("Вид", "Ремонт авто") ;
	Запрос.УстановитьПараметр("ДатаДок", ТекущаяДата());	
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат
	КонецЕсли;

	ДоступныеТочки = Новый Массив();
	Если Не ПараметрыСеанса.РольДоступнаАдминистратор Тогда
		//Определи доступные точки для отбора
		//-----------------------------------
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ТвП.Точка КАК СТРОКА(32)) КАК Точка
		|ИЗ
		|	Справочник.Предприятие КАК П
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТочкиПродажВподразделения КАК ТвП
		|		ПО П.Ссылка = ТвП.Подразделение
		|ГДЕ
		|	П.Ссылка В ИЕРАРХИИ (ВЫБРАТЬ РАЗЛИЧНЫЕ Подразделение ИЗ Справочник.Пользователи.Подразделения ГДЕ Ссылка = &Ссылка)";
		Запрос.УстановитьПараметр("Ссылка", ПараметрыСеанса.ТекущийПользователь);
		Рзт = Запрос.Выполнить();
		Если Не Рзт.Пустой() Тогда
			ДоступныеТочки = Рзт.Выгрузить().ВыгрузитьКолонку(0);
		КонецЕсли;
	КонецЕсли;
	
	ГрОтбора1 = ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГрОтбора1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		ЭлОтбора1 = ГрОтбора1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
		ЭлОтбора1.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("Точка");
		ЭлОтбора1.ПравоеЗначение=Выб.Точка;
		ЭлОтбора1.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
		
		Если ДоступныеТочки.Количество()>0 Тогда
			ЭлОтбора1.Использование = ?(ДоступныеТочки.Найти(Выб.Точка)=Неопределено, Ложь, Истина);
		Иначе
			ЭлОтбора1.Использование=Истина;		
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ		Т.ХарактеристикаОбъекта КАК ВидРемонта
	|ИЗ						РегистрСведений.Продажи КАК Т
	|ГДЕ					Т.Вид = &Вид	И Т.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаДок, МЕСЯЦ, -3) И &ДатаДок
	|УПОРЯДОЧИТЬ ПО			Т.ХарактеристикаОбъекта";
	Запрос.УстановитьПараметр("Вид", "Ремонт авто") ;
	Запрос.УстановитьПараметр("ДатаДок", ТекущаяДата());
	Рез = Запрос.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат
	КонецЕсли;
	ГрОтбора2 = ЭтаФорма.Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГрОтбора2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	Выб = Рез.Выбрать();
	Пока Выб.Следующий() Цикл
		ЭлОтбора2 = ГрОтбора2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));	
		ЭлОтбора2.ЛевоеЗначение=Новый ПолеКомпоновкиДанных("ВидРемонта");
		ЭлОтбора2.ПравоеЗначение=Выб.ВидРемонта;
		ЭлОтбора2.ВидСравнения=ВидСравненияКомпоновкиДанных.Равно;
		ЭлОтбора2.Использование=Истина;	
	КонецЦикла;
КонецПроцедуры
